
/************************************************************************/
/* 一些类型定义。可以直接复制代码，也可以引用该文件，引用该文件可能造成冲突           */
/************************************************************************/

#ifndef __TYPEDEF_H_
#define __TYPEDEF_H_

//////////////////////////////////////////////////////////////////////////
///{ 常用数据定义
/** 无符号8位
*/
using u8 = unsigned char;

/** 无符号16位
*/
using u16 = unsigned short;

/** 无符号32位
*/
using u32 = unsigned long;

/** 无符号64位
*/
using u64 = unsigned long long;

/** 有符号8位
*/
using s8 = char;

/** 有符号16位
*/
using s16 = short;

/** 有符号32位
*/
using s32 = long;

/** 有符号64位
*/
using s64= long long;
///}
//////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////
///{ buff的定义
#include <vector>

/** buff
*/
using ubuffA = std::vector<u8>;
using ubuffW = std::vector<u16>;
///}
////
#endif // __TYPEDEF_H_
