/******************************************************************************
 *  版权所有（C）2008-2019，上海二三四五网络科有限公司                        *
 *  保留所有权利。                                                            *
 ******************************************************************************
 *  作者 : 于登辉                                                             *
 *  版本 : 0.0.0.1                                                            *
 *****************************************************************************/

#include "color_print.h"

namespace utilstest
{
    void Test_ColorPrint()
    {
        ColorPrintfW(Green, L"green\r\n");
        ColorPrintf(Red, "red\r\n");
        ColorPrintfW(White, L"red\r\n");
    }
}

